{
 "@context": "https://schema.org",
 "@type": ["Product", "Decal"],
 "name": "Yellow Gang - Truck Back Window Graphics - Customizable",
 "image": "https://cdn.shopify.com/s/files/1/0830/7005/8780/files/39044-Yellow-Gang-TH.jpg?v=1709926232",
 "description": "\"Yellow Gang\" Truck Back Window Perforated Vinyl Graphic: Old West Resurgence, Modern Edge Ride with the formidable presence of the \"Yellow Gang\" Perforated Vinyl Graphic, exclusively crafted by Ink Monkey Designs. This graphic exudes the fearless essence of the Old West with a lineup of shadowy figures, cowboys poised with confidence, set against a striking yellow background that captures the dust and drama of a bygone era brought into the present day. Resilient Composition, Transparent Functionality Imprinted on high-quality perforated vinyl, the \"Yellow Gang\" graphic is a durable piece that resists the ravages of time and weather. With vibrant, steadfast OEM inks, the image is bold and compelling, while the material allows for an unobstructed view from the interior, giving the benefit of privacy with the added comfort of shade. Tailor-Made for the Bold and the Brave For the Outlaw at Heart: Personalize this emblem of wild spirit with your name, a significant date, or an inspiring quote that channels your inner renegade. For the Maverick Entrepreneur: Drive your brand with the rugged allure of the Wild West. Customize this graphic with your business logo or slogan, creating a mobile billboard that stands out on today's frontiers. Legal Considerations and Safety Notes Local Regulations Compliance: Ensure that the use of perforated graphics meets your state’s vehicle window visibility laws before installation. Safety Insight: Perforated vinyl may hold moisture in wet conditions, leading to a temporary decrease in visibility. This is only short-term, as the graphic dries and transparency is restored. Perfect Sizing and Effortless Installation The \"Yellow Gang\" graphic fits most full-size truck windows, standard at 18\" tall by 68\" wide. Measure your truck's rear window for a perfect fit. For installation support, our website features step-by-step video tutorials for both \"Dry\" and \"Wet\" application methods. Your Ride, Your Legend Every mile with the \"Yellow Gang\" graphic is a journey through time, where the legends of the Old West meet the highways of the modern age. Ink Monkey Designs ensures your truck is not just a vehicle but a moving tale of adventure and audacity. Customization is available! If you want a name or some other text added to the graphic, choose the Name / Text option. If you want business info and you have a logo that's ready to print (vector file or high resolution .png file) or you don't want to include a logo, choose the Business (logo ready / no logo) option. If you have a logo file that isn't a vector image or a hi-res .png file, choose Business (recreate logo). Finally, if you want us to design a logo for your decal, choose Business (design logo)",
 "sku": "yellow-gang-truck-back-window-graphics",
 "brand": { "@type": "Thing", "name": "Ink Monkey" },
 "offers": { "@type": "Offer", "availability": "https://schema.org/InStock", "price": "58.95", "priceCurrency": "USD" }
}
